# Основы pandas

In [1]:
import pandas as pd

Пример забора данных с сайтов

In [3]:
pd.read_clipboard(sep='\t')

   a  b  c
0  1  2  3
1  4  5  6

In [5]:
pd.read_html('http://www.cbr.ru')[0]

  Курсы валют с 17.09.2020 с 18.09.2020
0  Доллар США     74,9278₽     75,1941₽
1        Евро     88,8644₽     88,6313₽

In [6]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [7]:
df[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  16.09.20    749083    750900    754345   746570
 1  15.09.20    750901    753332    753755   746975
 2  14.09.20    753333    749345    755296   745730
 3  13.09.20    749355    750030    750495   749345
 4  11.09.20    750120    751475    753150   747490
 5  10.09.20    751915    753612    756810   746680
 6  09.09.20    753613    762907    764780   752035
 7  08.09.20    762861    757205    765850   756845
 8  07.09.20    757204    753815    762600   752500,
        Имя  Unnamed: 1     %    курс                 Дата
 0  EUR/RUB         NaN  6446   89072  17.09.2020 19:33:00
 1  USD/RUB         NaN  5634  753303  17.09.2020 19:33:00
 2  CHF/RUB         NaN  5258   82807  17.09.2020 19:34:00
 3  JPY/RUB         NaN  7028     719  17.09.2020 19:34:00
 4  GBP/RUB         NaN   343  975097  17.09.2020 19:34:00
 5  NOK/RUB         NaN -2308   82848  17.09.2020 19:33:00
 6  AUD/RUB         NaN  2799  548861  17.09.2020 19:33:00
 7  NZD/RUB         NaN  5725  507128  17.09.2020 19:33:00
 8  TRY/RUB         NaN -2593   99775  17.09.2020 19:33:00]

In [ ]:
pd.read_excel('', sheet_name='Лист2')

In [ ]:
import pymysql
connection = pymysql.connect(host='', db='', user='', pwd='', port=)

In [ ]:
pd.read_sql('select * from db.table limit 5;', connection)

In [ ]:
pd.read_json()

Импорт данных из файла

In [33]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [12]:
data.tail(20)

          country  year  quantity  category
1189462   Uruguay  2013    142.90        71
1189463   Uruguay  2012    117.80        71
1189464   Uruguay  2011    111.30        71
1189465   Uruguay  2010     69.90        71
1189466   Uruguay  2009     42.10        71
1189467   Uruguay  2008      7.30        71
1189468   Vanuatu  2014      3.00        71
1189469   Vanuatu  2013      3.00        71
1189470   Vanuatu  2012      2.90        71
1189471   Vanuatu  2011      5.00        71
1189472   Vanuatu  2010      5.17        71
1189473   Vanuatu  2009      5.63        71
1189474   Vanuatu  2008      5.63        71
1189475  Viet Nam  2014    300.00        71
1189476  Viet Nam  2013     92.00        71
1189477  Viet Nam  2012     92.00        71
1189478  Viet Nam  2011     87.00        71
1189479  Viet Nam  2010     50.00        71
1189480  Viet Nam  2009     10.00        71
1189481  Viet Nam  2008      1.00        71

In [13]:
type(data)

pandas.core.frame.DataFrame

CSV - comma separated value

\t ; ! ===

In [19]:
?pd.read_csv

In [17]:
# если надо указать свои заголовки и разделитель
data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = ',', header=0)
data.head()

    страна   год  количество  категория
0  Austria  1996         5.0          1
1  Austria  1995        17.0          1
2  Belgium  2014         0.0          1
3  Belgium  2013         0.0          1
4  Belgium  2012        35.0          1

In [20]:
data.columns

Index(['country', 'year', 'quantity', 'category'], dtype='object')

In [21]:
# количество строк в датафрейме

len(data)

1189482

In [22]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [23]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [24]:
df_tr = pd.read_csv('transactions.csv') 
len(df_tr)

60

In [28]:
df_tr.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [32]:
data = pd.read_csv('transactions.csv') 
display(data.head())
print(len(data))

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

60

In [27]:
data = pd.read_csv('transactions.csv')
data.shape

(60, 8)

### Основные сведения о датафрейме

In [35]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
country     1189482 non-null object
year        1189482 non-null int64
quantity    1189482 non-null float64
category    1189482 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [ ]:
3Gb <--> 7Gb

In [39]:
2**64

18446744073709551616

In [40]:
# немного статистики

data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [41]:
1.189482 * 10**6

1189482.0

In [ ]:
1.189482e+06 == 1.189482 * 10**6

### Отдельный столбец (тип Series)

In [42]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [ ]:
data['year of birth'].head()

In [45]:
data['unique']

AttributeError: 'DataFrame' object has no attribute 'unique'

In [44]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [ ]:
type(data['year'])

In [ ]:
data.head()

In [43]:
# уникальные значения в столбце

data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71])

In [ ]:
len(data['category'].unique())

In [46]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [47]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [48]:
data['category'].value_counts(normalize=True).head()

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [49]:
df_tr.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [50]:
df_tr['Product'].value_counts().head(1)

_5    11
Name: Product, dtype: int64

In [59]:
df_tr.Product.value_counts().index.values[0]

'_5'

In [58]:
df_tr.Product.value_counts().values

array([11,  8,  8,  7,  7,  5,  5,  5,  2,  2])

In [ ]:
data['Product'].value_counts()

In [51]:
data1 = pd.read_csv('transactions.csv') 
data1['Product'].value_counts().head(3)

_5    11
_8     8
_2     8
Name: Product, dtype: int64

# Фильтры

In [60]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [61]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [63]:
data[['country', 'quantity']]

          country  quantity
0         Austria       5.0
1         Austria      17.0
2         Belgium       0.0
3         Belgium       0.0
4         Belgium      35.0
...           ...       ...
1189477  Viet Nam      92.0
1189478  Viet Nam      87.0
1189479  Viet Nam      50.0
1189480  Viet Nam      10.0
1189481  Viet Nam       1.0

[1189482 rows x 2 columns]

In [ ]:
# или так

data[['country', 'quantity']].head()

### Отфильтруем строки с потреблением выше среднего

In [64]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [65]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [66]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query(f'quantity > {average_level}').head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [ ]:
if ...:
    ...

In [67]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [68]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [73]:
'город' in 'Город Москва столица России'

False

In [74]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [76]:
(2 + 2) * 2

8

In [77]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [78]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [79]:
# фильтры на номер строки

data.loc[1000:1005]

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка

In [80]:
# Сортировка по столбцу

data.sort_values('quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [81]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [82]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(50)

             country  year      quantity  category
835127   Afghanistan  2014  1.935442e+06        42
491541   Afghanistan  2014  6.600000e+04        31
492004   Afghanistan  2014  6.600000e+04        31
492292   Afghanistan  2014  6.600000e+04        31
791301   Afghanistan  2014  5.537080e+03        42
797879   Afghanistan  2014  5.537080e+03        42
811493   Afghanistan  2014  5.537080e+03        42
813883   Afghanistan  2014  5.537080e+03        42
820564   Afghanistan  2014  5.537080e+03        42
828390   Afghanistan  2014  5.537080e+03        42
832393   Afghanistan  2014  5.537080e+03        42
1097271  Afghanistan  2014  4.486800e+03        67
1091772  Afghanistan  2014  3.767300e+03        67
1108326  Afghanistan  2014  3.710800e+03        67
1061021  Afghanistan  2014  2.967300e+03        67
1045322  Afghanistan  2014  2.204900e+03        67
364480   Afghanistan  2014  1.758409e+03        25
369505   Afghanistan  2014  1.758396e+03        25
518535   Afghanistan  2014  1.517400e+03        31
521820   Afghanistan  2014  1.517400e+03        31
496034   Afghanistan  2014  1.388700e+03        31
502008   Afghanistan  2014  1.388700e+03        31
509843   Afghanistan  2014  1.388700e+03        31
512335   Afghanistan  2014  1.388700e+03        31
1102803  Afghanistan  2014  1.049300e+03        67
334666   Afghanistan  2014  1.002966e+03        25
341782   Afghanistan  2014  1.002966e+03        25
353105   Afghanistan  2014  1.002966e+03        25
357841   Afghanistan  2014  1.002966e+03        25
563371   Afghanistan  2014  8.953000e+02        33
407563   Afghanistan  2014  8.821000e+02        27
419783   Afghanistan  2014  8.821000e+02        27
432306   Afghanistan  2014  8.821000e+02        27
437547   Afghanistan  2014  8.821000e+02        27
442787   Afghanistan  2014  8.821000e+02        27
462537   Afghanistan  2014  8.821000e+02        27
1053124  Afghanistan  2014  8.000000e+02        67
1066512  Afghanistan  2014  8.000000e+02        67
1116171  Afghanistan  2014  7.760000e+02        67
374415   Afghanistan  2014  7.554300e+02        25
378276   Afghanistan  2014  7.554300e+02        25
1137168  Afghanistan  2014  7.423000e+02        67
713410   Afghanistan  2014  7.130000e+02        39
719887   Afghanistan  2014  7.130000e+02        39
727865   Afghanistan  2014  7.130000e+02        39
733131   Afghanistan  2014  7.130000e+02        39
738397   Afghanistan  2014  7.130000e+02        39
753073   Afghanistan  2014  7.130000e+02        39
1161790  Afghanistan  2014  5.933000e+02        67
1111003  Afghanistan  2014  5.000000e+02        67

### Параметр inplace

In [86]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
data = data.sort_values('country', ascending=True)

data.sort_values('country', ascending=True, inplace=True)

In [2]:
import pandas as pd

In [11]:
?pd.read_html

In [14]:
pd.read_html('https://cbr.ru/currency_base/daily/?UniDbQuery.Posted=True&UniDbQuery.To=17.09.2020', thousands='.')[0]

,Цифр. код,Букв. код,Единиц,Валюта,Курс
0,36,AUD,1,Австралийский доллар,"54,9221"
1,944,AZN,1,Азербайджанский манат,"44,1011"
2,51,AMD,100,Армянских драмов,"15,4392"
3,933,BYN,1,Белорусский рубль,"29,0767"
4,975,BGN,1,Болгарский лев,"45,4631"
5,986,BRL,1,Бразильский реал,"14,2011"
6,348,HUF,100,Венгерских форинтов,"24,8278"
7,410,KRW,1000,Вон Республики Корея,"63,8528"
8,344,HKD,10,Гонконгских долларов,"96,6798"
9,208,DKK,1,Датская крона,"11,9525"
10,840,USD,1,Доллар США,"74,9278"
11,978,EUR,1,Евро,"88,8644"
12,356,INR,10,Индийских рупий,"10,1908"
13,398,KZT,100,Казахстанских тенге,"17,6263"
14,124,CAD,1,Канадский доллар,"56,9144"
15,417,KGS,100,Киргизских сомов,"94,8453"
16,156,CNY,1,Китайский юань,"11,0812"
17,498,MDL,10,Молдавских леев,"45,1101"
18,934,TMT,1,Новый туркменский манат,"21,4386"
19,578,NOK,10,Норвежских крон,"83,3633"
20,985,PLN,1,Польский злотый,"19,9962"
21,946,RON,1,Румынский лей,"18,2992"
22,960,XDR,1,СДР (специальные права заимствования),"106,1457"
23,702,SGD,1,Сингапурский доллар,"55,1670"
24,972,TJS,10,Таджикских сомони,"72,6045"
25,949,TRY,1,Турецкая лира,"10,0002"
26,860,UZS,10000,Узбекских сумов,"72,9721"
27,980,UAH,10,Украинских гривен,"26,6457"
28,826,GBP,1,Фунт стерлингов Соединенного королевства,"96,6644"
29,203,CZK,10,Чешских крон,"33,2658"
30,752,SEK,10,Шведских крон,"85,4063"
31,756,CHF,1,Швейцарский франк,"82,6197"
32,710,ZAR,10,Южноафриканских рэндов,"45,7287"
33,392,JPY,100,Японских иен,"71,2140"

In [ ]:
def sort_df(rewrite):
    return data.sort_values('country', ascending=True, inplace=rewrite)

In [87]:
def sort_df(rewrite):
    if rewrite:
        data = data.sort_values('country', ascending=True)
        return data
    else:
        print(data.sort_values('country', ascending=True))
        return data

             country  year  quantity  category
585886   Afghanistan  2009    93.000        35
126104   Afghanistan  2007   102.639        14
126105   Afghanistan  2006    99.572        14
126106   Afghanistan  2005    96.598        14
126107   Afghanistan  2004    93.211        14
...              ...   ...       ...       ...
733106      Zimbabwe  2014   331.000        39
733107      Zimbabwe  2013   392.000        39
733108      Zimbabwe  2012   392.000        39
1071218     Zimbabwe  1991  4140.000        67
900985      Zimbabwe  2008     1.000        51

[1189482 rows x 4 columns]

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?